# ModifySubElement Method (SlabShapeVertex, Double) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeEditor..::..ModifySubElement Method (SlabShapeVertex, Double)
SlabShapeEditor Class See Also
---
Manipulates the vertex on the corresponding slab, roof or floor.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void ModifySubElement(
	SlabShapeVertex vertex,
	double offset
)
```

Visual Basic
---
```text
Public Sub ModifySubElement ( _
	vertex As SlabShapeVertex, _
	offset As Double _
)
```

Visual C++
---
```text
public:
void ModifySubElement(
	SlabShapeVertex^ vertex,
	double offset
)
```

# ### Parameters
vertex
    Type: Autodesk.Revit.DB..::..SlabShapeVertexThe vertex.
offset
    Type: System..::..DoubleThe new value of the vertex offset.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the vertex is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the vertex is invalid. |

# See Also
SlabShapeEditor Class
ModifySubElement Overload
Autodesk.Revit.DB Namespace